bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Boba Fett"], ["description", "Has cool uniform"], ["created_at", "2016-05-02 00:59:57.030080"], ["updated_at", "2016-05-02 00:59:57.030080"]]
---
  def create

    creature = Creature.new(creature_params)

    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    @creature = Creature.find_by_id(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @creature = Creature.find_by_id(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["description", "Frog with superhuman abilities!"], ["updated_at", "2016-05-02 01:30:39.860863"], ["id", 1]]
---
  def update
    creature = Creature.find_by_id(params[:id])
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 7]]
---
  def destroy
    creature = Creature.find_by_id(params[:id])
    creature.destroy